
# Titanic Data Analysis (Jupyter / Marimo)

Demo - `HuggDuckDBConnection` class usage

In [1]:
import marimo as mo
from huggingduck import HuggDuckDBConnection

# Initialise connection

In [8]:
conn = HuggDuckDBConnection("mjboothaus/titanic-databooth")

if conn:
    mo.md(f"## Available Tables: {', '.join(conn.tables)}")

2025-04-24 15:29:35 | INFO | Loading dataset: mjboothaus/titanic-databooth
2025-04-24 15:29:39 | SUCCESS | Created table: titanic_sample10 (10 rows)

In [3]:
# Table selector

# table = mo.ui.select(conn.tables, label="Choose dataset version")

conn.tables[0]

'titanic_sample10'

In [11]:
# Data preview

# preview = conn.preview(table.value)
# mo.ui.table(preview)

conn.sql(f"SELECT * FROM {conn.tables[0]}")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,None,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,None,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,None,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,None,C

In [5]:
# Schema inspection

#mo.md(f"### {table.value} Schema")
#mo.ui.json(
    
conn.get_schema(conn.tables[0])

{'PassengerId': 'BIGINT',
 'Survived': 'BIGINT',
 'Pclass': 'BIGINT',
 'Name': 'VARCHAR',
 'Sex': 'VARCHAR',
 'Age': 'DOUBLE',
 'SibSp': 'BIGINT',
 'Parch': 'BIGINT',
 'Ticket': 'VARCHAR',
 'Fare': 'DOUBLE',
 'Cabin': 'VARCHAR',
 'Embarked': 'VARCHAR'}

In [6]:
# Age discrepancy analysis

# mo.md("## Age Discrepancy Report")

# results = conn.query(f"""
#     SELECT 
#         original.passenger_id,
#         original.age AS reported_age,
#         {table.value}.age AS corrected_age,
#         ABS(original.age - {table.value}.age) AS difference
#     FROM original
#     JOIN {table.value} ON original.passenger_id = {table.value}.passenger_id
#     WHERE ABS(original.age - {table.value}.age) > 2
#     ORDER BY difference DESC
# """)
# mo.ui.table(results)